#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>
```


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

aws_iam_role.node: Refreshing state... [id=eks-node-group-role]
aws_vpc.vpc_fiap: Refreshing state... [id=vpc-0fee7fca4df8dc99f]
aws_iam_role.cluster: Refreshing state... [id=eks-cluster-role]
aws_s3_bucket.spoobucket-aula: Refreshing state... [id=spoo-ent3-backend]
aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_internet_gateway.igw: Refreshing state... [id=igw-03472ed8e56ce1e93]
aws_subnet.subnet_public[1]: Refreshing state... [id=subnet-03b5cd06b2afc00eb]
aws_subnet.subnet_public[0]: Refreshing state... [id=subnet-0e87a876fe8224bc8]
aws_security_group.sg: Refreshing state... [id=sg-0ad5d2bf8399368b1]
aws_subnet.subnet_public[2]: Refreshing state... [id=subnet-0e2967af54dd1ba14]
aws_route_table.rt_public: Refreshing state... [id=rtb-02acc5ad81a3bdbfd]
aws_route_table_association.rt_association_1: Refreshing state... [id=rtbassoc-03b19afdf874675c4]
aws_route_table_association.rt_association_2: Refreshing state... [id=rtbassoc-0f163e0a060850b97]
aws_route_table_association.rt_association_0: Refreshing state... [id=rtbassoc-0048bee5cb7ec3dc4]
aws_eks_cluster.cluster: Refreshing state... [id=eks-spoo-ent3-backend]
data.aws_eks_cluster_auth.auth: Reading...
aws_eks_access_entry.access_entry: Refreshing state... [id=eks-spoo-ent3-backend:arn:aws:iam::579375260812:user/camila]
aws_eks_access_policy_association.access_entry_association: Refreshing state... [id=eks-spoo-ent3-backend#arn:aws:iam::579375260812:user/camila#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy]
aws_eks_node_group.node: Refreshing state... [id=eks-spoo-ent3-backend:nodeg-spoo-ent3-backend]
data.aws_eks_cluster_auth.auth: Read complete after 0s [id=eks-spoo-ent3-backend]
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster.cluster: Read complete after 0s [id=eks-spoo-ent3-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.aws_auth will be created
  + resource "kubectl_manifest" "aws_auth" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "aws-auth"
      + namespace               = "kube-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              mapUsers: |
                - userarn: arn:aws:iam::579375260812:user/camila
                  username: camila
                  groups:
                    - system:masters
            kind: ConfigMap
            metadata:
              name: aws-auth
              namespace: kube-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.deploy will be created
  + resource "kubectl_manifest" "deploy" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "nginx-deploy"
      + namespace               = "nginx"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              name: nginx-deploy
              namespace: nginx
            spec:
              replicas: 3
              selector:
                matchLabels:
                  app: nginx
              template:
                metadata:
                  labels:
                    app: nginx
                spec:
                  containers:
                  - image: nginx:1.25
                    name: nginx
                    ports:
                    - containerPort: 80
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.namespace will be created
  + resource "kubectl_manifest" "namespace" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "nginx"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.service will be created
  + resource "kubectl_manifest" "service" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "nginx-service"
      + namespace               = "nginx"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              name: nginx-service
              namespace: nginx
            spec:
              ports:
              - port: 80
                protocol: TCP
                targetPort: 80
              selector:
                app: nginx
              type: LoadBalancer
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @CRASPOO, Action: `pull_request`*